In [132]:
#%pip install pandas

In [133]:
import numpy as np 
import pandas as pd

print(np.__version__)
print(pd.__version__)

2.0.2
2.3.3

In [134]:
df = pd.read_csv("../Dataset-And-Solve-Class/class-7/Class-7-homelessness.csv")
print(type(df))
df.head()

<class 'pandas.core.frame.DataFrame'>

,Unnamed: 0,region,state,individuals,family_members,state_pop
0,0,East South Central,Alabama,2570.0,864.0,4887681
1,1,Pacific,Alaska,1434.0,582.0,735139
2,2,Mountain,Arizona,7259.0,2606.0,7158024
3,3,West South Central,Arkansas,2280.0,432.0,3009733
4,4,Pacific,California,109008.0,20964.0,39461588

In [135]:
df.tail()

,Unnamed: 0,region,state,individuals,family_members,state_pop
46,46,South Atlantic,Virginia,3928.0,2047.0,8501286
47,47,Pacific,Washington,16424.0,5880.0,7523869
48,48,South Atlantic,West Virginia,1021.0,222.0,1804291
49,49,East North Central,Wisconsin,2740.0,2167.0,5807406
50,50,Mountain,Wyoming,434.0,205.0,577601

In [136]:
df.columns

Index(['Unnamed: 0', 'region', 'state', 'individuals', 'family_members',
       'state_pop'],
      dtype='object')

In [137]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      51 non-null     int64
 1   region          51 non-null     object
 2   state           51 non-null     object
 3   individuals     51 non-null     float64
 4   family_members  51 non-null     float64
 5   state_pop       51 non-null     int64
dtypes: float64(2), int64(2), object(2)
memory usage: 2.5+ KB

In [138]:
df.drop("Unnamed: 0", axis=1, inplace=True)

In [139]:
df.head()

               region       state  individuals  family_members  state_pop
0  East South Central     Alabama       2570.0           864.0    4887681
1             Pacific      Alaska       1434.0           582.0     735139
2            Mountain     Arizona       7259.0          2606.0    7158024
3  West South Central    Arkansas       2280.0           432.0    3009733
4             Pacific  California     109008.0         20964.0   39461588

In [140]:
df.describe()

         individuals  family_members     state_pop
count      51.000000       51.000000  5.100000e+01
mean     7225.784314     3504.882353  6.405637e+06
std     15991.025083     7805.411811  7.327258e+06
min       434.000000       75.000000  5.776010e+05
25%      1446.500000      592.000000  1.777414e+06
50%      3082.000000     1482.000000  4.461153e+06
75%      6781.500000     3196.000000  7.340946e+06
max    109008.000000    52070.000000  3.946159e+07

In [141]:
df[['state', 'region']].head()

        state              region
0     Alabama  East South Central
1      Alaska             Pacific
2     Arizona            Mountain
3    Arkansas  West South Central
4  California             Pacific

In [142]:
df.loc[0] #first row

region            East South Central
state                        Alabama
individuals                   2570.0
family_members                 864.0
state_pop                    4887681
Name: 0, dtype: object

In [143]:
df.iloc[1]

region            Pacific
state              Alaska
individuals        1434.0
family_members      582.0
state_pop          735139
Name: 1, dtype: object

In [144]:
mask = df['family_members'] < 500
df[mask]

                region          state  individuals  family_members  state_pop
3   West South Central       Arkansas       2280.0           432.0    3009733
7       South Atlantic       Delaware        708.0           374.0     965479
24  East South Central    Mississippi       1024.0           328.0    2981020
26            Mountain        Montana        983.0           422.0    1060665
28            Mountain         Nevada       7058.0           486.0    3027341
34  West North Central   North Dakota        467.0            75.0     758080
39         New England   Rhode Island        747.0           354.0    1058287
41  West North Central   South Dakota        836.0           323.0     878698
48      South Atlantic  West Virginia       1021.0           222.0    1804291
50            Mountain        Wyoming        434.0           205.0     577601

In [145]:
print(f"total count =", mask.sum())

total count = 10

In [146]:
print(f'total count = ', df[mask].shape[0])

total count =  10

In [147]:
mask.value_counts()

family_members
False    41
True     10
Name: count, dtype: int64

In [148]:
df = df.sort_values('family_members', ascending=False)
df.head()

                region          state  individuals  family_members  state_pop
32        Mid-Atlantic       New York      39827.0         52070.0   19530351
4              Pacific     California     109008.0         20964.0   39461588
21         New England  Massachusetts       6811.0         13257.0    6882635
9       South Atlantic        Florida      21443.0          9587.0   21244317
43  West South Central          Texas      19199.0          6111.0   28628666

In [149]:
df.sort_values(['region','family_members']).head()

                region      state  individuals  family_members  state_pop
14  East North Central    Indiana       3776.0          1482.0    6695497
49  East North Central  Wisconsin       2740.0          2167.0    5807406
22  East North Central   Michigan       5209.0          3142.0    9984072
35  East North Central       Ohio       6929.0          3320.0   11676341
13  East North Central   Illinois       6752.0          3891.0   12723071

In [150]:
df.rename(
    columns={
        'individuals': 'individuals (USD)',
        'family_members': 'family_members (USD)',
        'state_pop': 'state_pop (total)'
    }, 
    inplace=True
)
df.head()

,region,state,individuals (USD),family_members (USD),state_pop (total)
32,Mid-Atlantic,New York,39827.0,52070.0,19530351
4,Pacific,California,109008.0,20964.0,39461588
21,New England,Massachusetts,6811.0,13257.0,6882635
9,South Atlantic,Florida,21443.0,9587.0,21244317
43,West South Central,Texas,19199.0,6111.0,28628666

In [151]:
df['family_members (USD)'] = df['family_members (USD)'].apply(lambda x: x * 2)
df['family_members (USD)'].sort_values(ascending=False).head()

32    104140.0
4      41928.0
21     26514.0
9      19174.0
43     12222.0
Name: family_members (USD), dtype: float64

In [152]:
df.groupby('family_members (USD)')['state_pop (total)'].mean().sort_values(ascending=False).head()

family_members (USD)
41928.0     39461588.0
12222.0     28628666.0
19174.0     21244317.0
104140.0    19530351.0
10698.0     12800922.0
Name: state_pop (total), dtype: float64

In [153]:
df.keys()

Index(['region', 'state', 'individuals (USD)', 'family_members (USD)',
       'state_pop (total)'],
      dtype='object')

In [154]:
df.values

array([['Mid-Atlantic', 'New York', 39827.0, 104140.0, 19530351],
       ['Pacific', 'California', 109008.0, 41928.0, 39461588],
       ['New England', 'Massachusetts', 6811.0, 26514.0, 6882635],
       ['South Atlantic', 'Florida', 21443.0, 19174.0, 21244317],
       ['West South Central', 'Texas', 19199.0, 12222.0, 28628666],
       ['Pacific', 'Washington', 16424.0, 11760.0, 7523869],
       ['Mid-Atlantic', 'Pennsylvania', 8163.0, 10698.0, 12800922],
       ['East North Central', 'Illinois', 6752.0, 7782.0, 12723071],
       ['Mid-Atlantic', 'New Jersey', 6048.0, 6700.0, 8886025],
       ['Pacific', 'Oregon', 11139.0, 6674.0, 4181886],
       ['East North Central', 'Ohio', 6929.0, 6640.0, 11676341],
       ['West North Central', 'Minnesota', 3993.0, 6500.0, 5606249],
       ['Mountain', 'Colorado', 7607.0, 6500.0, 5691287],
       ['East North Central', 'Michigan', 5209.0, 6284.0, 9984072],
       ['South Atlantic', 'District of Columbia', 3770.0, 6268.0, 701547],
       ['South Atlantic', 'North Carolina', 6451.0, 5634.0, 10381615],
       ['Mountain', 'Arizona', 7259.0, 5212.0, 7158024],
       ['South Atlantic', 'Georgia', 6943.0, 5112.0, 10511131],
       ['Pacific', 'Hawaii', 4131.0, 4798.0, 1420593],
       ['South Atlantic', 'Maryland', 4914.0, 4460.0, 6035802],
       ['East North Central', 'Wisconsin', 2740.0, 4334.0, 5807406],
       ['West North Central', 'Missouri', 3776.0, 4214.0, 6121623],
       ['South Atlantic', 'Virginia', 3928.0, 4094.0, 8501286],
       ['East South Central', 'Tennessee', 6139.0, 3488.0, 6771631],
       ['New England', 'Connecticut', 2280.0, 3392.0, 3571520],
       ['East North Central', 'Indiana', 3776.0, 2964.0, 6695497],
       ['New England', 'Maine', 1450.0, 2132.0, 1339057],
       ['West South Central', 'Oklahoma', 2823.0, 2096.0, 3940235],
       ['West North Central', 'Iowa', 1711.0, 2076.0, 3148618],
       ['Mountain', 'Utah', 1904.0, 1944.0, 3153550],
       ['East South Central', 'Kentucky', 2735.0, 1906.0, 4461153],
       ['East South Central', 'Alabama', 2570.0, 1728.0, 4887681],
       ['South Atlantic', 'South Carolina', 3082.0, 1702.0, 5084156],
       ['West North Central', 'Kansas', 1443.0, 1546.0, 2911359],
       ['Mountain', 'Idaho', 1297.0, 1430.0, 1750536],
       ['West North Central', 'Nebraska', 1745.0, 1352.0, 1925614],
       ['New England', 'New Hampshire', 835.0, 1230.0, 1353465],
       ['Mountain', 'New Mexico', 1949.0, 1204.0, 2092741],
       ['Pacific', 'Alaska', 1434.0, 1164.0, 735139],
       ['West South Central', 'Louisiana', 2540.0, 1038.0, 4659690],
       ['New England', 'Vermont', 780.0, 1022.0, 624358],
       ['Mountain', 'Nevada', 7058.0, 972.0, 3027341],
       ['West South Central', 'Arkansas', 2280.0, 864.0, 3009733],
       ['Mountain', 'Montana', 983.0, 844.0, 1060665],
       ['South Atlantic', 'Delaware', 708.0, 748.0, 965479],
       ['New England', 'Rhode Island', 747.0, 708.0, 1058287],
       ['East South Central', 'Mississippi', 1024.0, 656.0, 2981020],
       ['West North Central', 'South Dakota', 836.0, 646.0, 878698],
       ['South Atlantic', 'West Virginia', 1021.0, 444.0, 1804291],
       ['Mountain', 'Wyoming', 434.0, 410.0, 577601],
       ['West North Central', 'North Dakota', 467.0, 150.0, 758080]],
      dtype=object)

In [155]:
df.columns

Index(['region', 'state', 'individuals (USD)', 'family_members (USD)',
       'state_pop (total)'],
      dtype='object')

In [156]:
df.columns = ['region', 'state', 'individuals', 'family_members','state_pop']
df.columns

Index(['region', 'state', 'individuals', 'family_members', 'state_pop'], dtype='object')

In [157]:
df.head()

                region          state  individuals  family_members  state_pop
32        Mid-Atlantic       New York      39827.0        104140.0   19530351
4              Pacific     California     109008.0         41928.0   39461588
21         New England  Massachusetts       6811.0         26514.0    6882635
9       South Atlantic        Florida      21443.0         19174.0   21244317
43  West South Central          Texas      19199.0         12222.0   28628666

In [158]:
df['total_population'] = df['state_pop'] + df['family_members']
df.head()

,region,state,individuals,family_members,state_pop,total_population
32,Mid-Atlantic,New York,39827.0,104140.0,19530351,19634491.0
4,Pacific,California,109008.0,41928.0,39461588,39503516.0
21,New England,Massachusetts,6811.0,26514.0,6882635,6909149.0
9,South Atlantic,Florida,21443.0,19174.0,21244317,21263491.0
43,West South Central,Texas,19199.0,12222.0,28628666,28640888.0

In [159]:
df.query(
    'state_pop > 1000000' and 'individuals < 500'
)

,region,state,individuals,family_members,state_pop,total_population
50,Mountain,Wyoming,434.0,410.0,577601,578011.0
34,West North Central,North Dakota,467.0,150.0,758080,758230.0

In [160]:
df['total_population'].sum()

np.float64(327044999.0)

In [161]:
df['total_population'].min()

np.float64(578011.0)

In [162]:
df['total_population'].max()

np.float64(39503516.0)

In [163]:
df['total_population'].std()

np.float64(7336477.670351597)

In [164]:
df['total_population'].mean()

np.float64(6412647.039215687)

In [165]:
df['total_population'].quantile(1.0)

np.float64(39503516.0)

In [166]:
df['total_population'].quantile(0.75)

np.float64(7349432.5)

In [167]:
def calculateNormalization(col):
    return (col - col.mean()) / col.std()

In [168]:
df['total_population'] = calculateNormalization(df['total_population'])
df.sort_values(by='total_population', inplace=True)
df.head()

,region,state,individuals,family_members,state_pop,total_population
50,Mountain,Wyoming,434.0,410.0,577601,-0.795291
45,New England,Vermont,780.0,1022.0,624358,-0.788835
8,South Atlantic,District of Columbia,3770.0,6268.0,701547,-0.777598
1,Pacific,Alaska,1434.0,1164.0,735139,-0.773715
34,West North Central,North Dakota,467.0,150.0,758080,-0.770726